# GetWindowRectangle Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
UIView..::..GetWindowRectangle Method
UIView Class See Also
---
Gets the rectangle containing the coordinates of the view's drawing area.
**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Rectangle GetWindowRectangle()
```

Visual Basic
---
```text
Public Function GetWindowRectangle As Rectangle
```

Visual C++
---
```text
public:
Rectangle^ GetWindowRectangle()
```

# ### Return Value
The rectangle of the view window.
# See Also
UIView Class
Autodesk.Revit.UI Namespace